<a href="https://colab.research.google.com/github/EmmaGB/Notebooks-Curso-Big-Data/blob/main/Ejercicios_Pandas_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

El fichero train.csv contiene información sobre los pasajeros del Titanic. 

Descargue el fichero train.csv en su ordenador desde
https://www.kaggle.com/c/titanic/data?select=train.csv

Suba el fichero train.csv a la carpeta sample_data de Google Colab

1. Generar un DataFrame con los datos del fichero.

# Nueva sección

In [2]:
import pandas as pd

# Generar un DataFrame con los datos del fichero.
titanic = pd.read_csv('sample_data/train.csv', index_col=0)

print(titanic)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[891 rows x 11 columns]

2. Mostrar por pantalla las dimensiones del DataFrame y el número de datos que contiene

In [19]:
 print(titanic.shape)
 print(titanic.size)

(891, 11)
9801

3. Mostrar los nombres de sus columnas y filas

In [20]:
print(titanic.columns)
print(titanic.index)

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
           dtype='int64', name='PassengerId', length=891)

4. Mostrar los tipos de datos del DataFrame

In [11]:
tipo=type(titanic)
tipo

pandas.core.frame.DataFrame

In [21]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 123.5+ KB

5. Mostrar las 10 primeras filas y las 10 últimas filas.

In [15]:
titanic.head(10)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C

[10 rows x 11 columns]

In [16]:
titanic.tail(10)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
882                 0       3  ...   NaN        S
883                 0       3  ...   NaN        S
884                 0       2  ...   NaN        S
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[10 rows x 11 columns]

6. Mostrar por pantalla los datos del pasajero con identificador 148

In [9]:
pasajero=titanic.loc[148]
pasajero

Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object

In [23]:
titanic.iloc[147]

Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object

7. Mostrar cuántos pasajeros viajaban en el Titanic

In [24]:
len(titanic)

891

8. Mostrar cuántos pasajeros sobrevivieron al naufragio

In [ ]:
numsuper=len(titanic[titalnic'survived']==1)

In [28]:
print(titanic['Survived'].sum())

342

In [ ]:
numsuperv=titanic[titanic[]]

9. Mostrar la suma de las tarifas (columna Fare)

In [29]:
print['fare'].sum()

TypeError: ignored

10. Mostrar la edad media de los pasajeros del Titanic

In [30]:
titanic['Age'].mean()

29.69911764705882

11. Mostrar la edad media de los pasajeros según su género

In [32]:
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

12. Mostrar las columnas de nombre y edad de los pasajeros

13. Mostrar los pasajeros mayores de 65 años

14. Mostrar por pantalla las filas pares del DataFrame.

15. Mostrar los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

16. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron

17. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase

18. Eliminar del DataFrame los pasajeros con edad desconocida.

19. Mostrar la edad media de las mujeres que viajaban en cada clase.

20. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

21. Mostrar el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

22. Añadir una columna con la longitud de caracteres del nombre del pasajero